app/controllers/link_controller.rb

  def listTypes
  	links = LinkType.all
---
SELECT "link_types".* FROM "link_types"